DataProcessors/гф_ДиспетчерПереводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>гф_ДиспетчерПереводов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>_ОбъектыПеревода</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/гф_ПереводЗначенийРеквизитовИСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ПереводЗначенийРеквизитовИСвойств</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыЯзыков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCharacteristicTypes/гф_ГлобальныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<ChartOfCharacteristicTypes>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ГлобальныеЗначения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.гф_ГлобальныеЗначения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДанныеХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.гф_ГлобальныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыДляРоялти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

DataProcessors/гф_ДиспетчерПереводов/Forms/ФормаПереводаОбъектов/Ext/Form/Module.bsl
#Область Основные

&НаКлиенте
Процедура ТолькоБезПеревода(Команда)
	
	ТолькоБезПеревода = Не ТолькоБезПеревода;
	Элементы.ФормаТолькоБезПеревода.Пометка = ТолькоБезПеревода;
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Заголовок = Заголовок + " (" + ЯзыкПеревода + ")";
	Элементы.ФормаТолькоБезПеревода.Пометка = ТолькоБезПеревода;
	
	ОбновитьДанные();
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьДанные()
	
	ТаблицаОбъекты.Очистить();
	
	Для Каждого СтрокаОбъекты Из Объект.Объекты Цикл
		
		Если ТолькоБезПеревода И Не ПустаяСтрока(СтрокаОбъекты.Перевод) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицыОбъекты = ТаблицаОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыОбъекты, СтрокаОбъекты);
		
	КонецЦикла;
	
	ТаблицаОбъекты.Сортировать("ТипОбъекта");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивНоменклатур = Параметры.МассивНоменклатур;
	ЯзыкПеревода = Параметры.ЯзыкПеревода;
	ТолькоБезПеревода = Параметры.ТолькоБезПеревода;
	
	СвойстваДляПеревода = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гф_ГлобальныеЗначенияСписок.Значение.Ссылка КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.гф_ГлобальныеЗначения.Список КАК гф_ГлобальныеЗначенияСписок
		|ГДЕ
		|	гф_ГлобальныеЗначенияСписок.Ссылка.Ключ = &Ключ";
	
	Запрос.УстановитьПараметр("Ключ", "гф_ГлобальныеЗначенияСвойстваСПереводом");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	выборка = РезультатЗапроса.Выбрать();
	
	Пока выборка.Следующий() Цикл
		СвойстваДляПеревода.Добавить(выборка.Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект В(&мНоменклатур)
		|	И ДополнительныеСведения.Свойство В(&мСвойств)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Значение КАК Значение
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Значение";
	
	Запрос.УстановитьПараметр("мСвойств", СвойстваДляПеревода);
	Запрос.УстановитьПараметр("мНоменклатур", МассивНоменклатур);
	
	ОбъектыПеревода = Запрос.Выполнить().Выгрузить();	
	
	Для Каждого СтрОбъект Из ОбъектыПеревода Цикл
				
		ОбъектБокс = ПолучитьСлужебныйКонтейнер(СтрОбъект.Значение);
		
		СтрокаОбъекты = Объект.Объекты.Добавить();
		СтрокаОбъекты.Объект = ОбъектБокс.ИсходныйОбъект;
		СтрокаОбъекты.Наименование = НазваниеОбъекта(ОбъектБокс);
		
		Если Не ОбъектБокс.ЭтоСтрока Тогда
			
			СтрокаОбъекты.ТипОбъекта = ОбъектБокс.Объект.Метаданные().ПолноеИмя();
			
		Иначе
			
			СтрокаОбъекты.ТипОбъекта = "Строка";
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		| Объект,
		|	Значение
		|ИЗ РегистрСведений.гф_ПереводЗначенийРеквизитовИСвойств
		|ГДЕ Объект В (&Объекты) И Язык = &Язык";
	
	Запрос.УстановитьПараметр("Объекты", ОбъектыПеревода);
	Запрос.УстановитьПараметр("Язык", ЯзыкПеревода);

	ТаблицаПереводов = Запрос.Выполнить().Выгрузить();
	
	// проверка, все ли переводы есть
	Для Каждого СтрокаОбъекты Из Объект.Объекты Цикл
		
		СтрокаТаблицыПереводов = ТаблицаПереводов.Найти(СтрокаОбъекты.Объект, "Объект");
		
		Если СтрокаТаблицыПереводов <> Неопределено Тогда
			
			СтрокаОбъекты.Перевод = СтрокаТаблицыПереводов.Значение;				
						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСлужебныйКонтейнер(ПараметрОбъект) Экспорт
	
	СтрокаОбъект = ?(ПараметрОбъект = Неопределено, "", ПараметрОбъект);
	
	ЭтоСтрока = (ТипЗнч(СтрокаОбъект) = Тип("Строка"));
	
	ЭтоДокумент = ?(ЭтоСтрока, Ложь, Лев(СтрокаОбъект.Метаданные().ПолноеИмя(), 8) = "Документ");
	
	ТекСтруктура = Новый Структура;
	ТекСтруктура.Вставить("ИсходныйОбъект", СтрокаОбъект);
	ТекСтруктура.Вставить("Объект", ?(ЭтоСтрока, НРег(СтрокаОбъект), СтрокаОбъект));
	ТекСтруктура.Вставить("ЭтоСтрока", ЭтоСтрока);
	ТекСтруктура.Вставить("ЭтоДокумент", ЭтоДокумент);
	
	Возврат ТекСтруктура;
	
КонецФункции

&НаСервере
Функция НазваниеОбъекта(ОбъектБокс) Экспорт
	
	Если ОбъектБокс.ЭтоСтрока Тогда
		
		Возврат ОбъектБокс.ИсходныйОбъект;
		
	Иначе
		
		Попытка
			
			Возврат ОбъектБокс.Объект.Наименование;
			
		Исключение
			
			Возврат ?(ОбъектБокс.Объект = Неопределено, "", Строка(ОбъектБокс.Объект.Ссылка));
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбъектыПереводПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабличноеПолеНепереведенныеОбъекты.ТекущиеДанные;

	ОбъектыПереводПриИзмененииНаСервере(ТекДанные.Объект, ТекДанные.Перевод);
	
КонецПроцедуры

&НаСервере
Процедура ОбъектыПереводПриИзмененииНаСервере(СтрокаОбъект, Перевод)
	
	Если Не ПустаяСтрока(Перевод) Тогда
		
		МЗ = РегистрыСведений.гф_ПереводЗначенийРеквизитовИСвойств.СоздатьМенеджерЗаписи();
		МЗ.Объект = СтрокаОбъект;
		МЗ.Язык = ЯзыкПеревода;
		МЗ.Значение = Перевод;
		
		Попытка
			
			МЗ.Записать();
			
			Отбор = Новый Структура;
			Отбор.Вставить("Объект", СтрокаОбъект);
			мОбъектов = Объект.Объекты.НайтиСтроки(Отбор);
			Для каждого Стр  Из мОбъектов Цикл
			
				Стр.Перевод = Перевод;		
			
			КонецЦикла;
			
		Исключение
			
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
